def count_letters(text):
    letcnt = {}

    for sym in text:
        if sym.isalpha():
            lowsym = sym.lower()
            if lowsym in letcnt:
                letcnt[lowsym] += 1
            else:
                letcnt[lowsym] = 1

    return letcnt

def calculate_frequency(letcnt):
    totallet = sum(letcnt.values())
    freq = {}

    for let, count in letcnt.items():
        freq[let] = round(count / totallet, 2)

    return freq

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

letcnt = count_letters(main_str)
freq = calculate_frequency(letcnt)

for letter, freq in freq.items():
    print(f"{letter}: {freq:.2f}")